[{"data":1,"prerenderedAt":235},["ShallowReactive",2],{"search":3,"$QD8d9NkvSp":195,"$36R8oiM1IC":196,"$ieVj5Qgsky":226},[4,10,16,21,26,31,36,41,46,51,56,61,66,71,76,81,85,89,92,95,98,101,106,111,116,121,126,131,136,141,146,151,156,161,166,171,176,181,186,191],{"id":5,"title":6,"titles":7,"content":8,"level":9},"/1-pochatok-roboty-z-esp32","Початок роботи з ESP32",[],"Стаття призначена для тих, хто тільки починає знайомство з платою розробки ESP32. Якщо ви знайомі з ESP8266, ESP32 це його вдосконалена версія. Плата поєднує бездротові можливості Wi-Fi та Bluetooth та двоядерний процесор.",1,{"id":11,"title":12,"titles":13,"content":14,"level":15},"/1-pochatok-roboty-z-esp32#esp32-devkit-v1","ESP32 DEVKIT V1",[6],"У статті розглядається ESP32 DEVKIT V1. Але всі приклади сумісні з іншими плата розробки ESP32 на чіпі ESP-WROOM-32. Приклади плат ESP32:",2,{"id":17,"title":18,"titles":19,"content":20,"level":15},"/1-pochatok-roboty-z-esp32#яку-esp32-вибрати","Яку ESP32 вибрати",[6],"Характеристики Кількість ядер2 (Dual Core)Тактова частотадо 240 МГцАрхітектура32-bitRAM512 КБWi-Fi2.4 ГГц, до 150 Мбіт/сBluetoothBLE (Bluetooth Low Energy) та Legacy BluetoothКількість пінів введення/виводу (GPIO)30 або 36 в залежності від моделіПериферіяАЦП (аналого-цифровий перетворювач), ЦАП (цифро-аналоговий перетворювач), UART (універсальний асинхронний приймач), SPI (послідовний периферійний інтерфейс), I2C (послідовна асиметрична шина) та багато іншого.",{"id":22,"title":23,"titles":24,"content":25,"level":15},"/1-pochatok-roboty-z-esp32#середовище-розробки","Середовище розробки",[6],"ESP32 можна програмувати за допомогою: Arduino IDEEspressif IDF (IoT Development Framework)MicropythonJavaScriptLUA",{"id":27,"title":28,"titles":29,"content":30,"level":15},"/1-pochatok-roboty-z-esp32#підготовка-до-роботи-з-esp32-в-середовищі-arduino-ide","Підготовка до роботи з ESP32 в середовищі Arduino IDE",[6],"Інструкція для Windows Інструкція для Mac and Linux",{"id":32,"title":33,"titles":34,"content":35,"level":15},"/1-pochatok-roboty-z-esp32#розпіновка-esp32","Розпіновка ESP32",[6],"ESP32 має більше контактів GPIO з більшою функціональністю в порівнянні з ESP826. У програмному коді можна встановити режим роботи GPIO пінів: UART, I2C або SPI. Це можливо завдяки функції мультиплексування мікросхеми ESP32, яка дозволяє призначати кілька функцій одному й тому висновку. Якщо їх не встановити в коді, контакти будуть використовуватися за умовчанням, як показано на малюнку нижче (розташування контактів може змінюватися залежно від виробника). Версія з 30 панами входу/виходу Версія з 36 панами входу/виходу Розпіновка ESP32: Які GPIO піни слід використовувати?",{"id":37,"title":38,"titles":39,"content":40,"level":15},"/1-pochatok-roboty-z-esp32#завантаження-коду-програми-в-esp32-через-arduino-ide","Завантаження коду програми в ESP32 через Arduino IDE",[6],"Розглянемо простий приклад миготіння вбудованим світлодіодом. Відкрийте Arduino IDE на своєму комп'ютері та скопіюйте наступний код: // світлодіод на ESP32 під'єднано до GPIO 23\nconst int ledPin = 23;\n\n// функція setup виконується один раз під час підключення живлення або перезавантаження плати\nvoid setup () {\n  // ініціалізація режиму роботи цифрового піна ledPin як вихідний\n  pinMode(ledPin, OUTPUT);\n}\n\n// функція loop виконується нескінченну кількість разів по колу\nvoid loop () {\n  digitalWrite(ledPin, HIGH);  // подаємо цифровий сигнал високого рівня (HIGH) на пін ledPin, тобто включаємо світлодіод\n  delay(1000); // чекаємо 1 секунду\n  digitalWrite(ledPin, LOW); // подаємо сигнал низького рівня (LOW), тобто вимикаємо світлодіод\n  delay(1000); // чекаємо 1 секунду\n} Цей код включає та вимикає світлодіод, підключений до GPIO 23 з інтервалом в одну секунду.",{"id":42,"title":43,"titles":44,"content":45,"level":15},"/1-pochatok-roboty-z-esp32#ускладнимо-приклад","Ускладнимо приклад",[6],"Крім увімкнення/вимкнення вбудованого піна, можна під'єднати зовнішній світлодіод до порту 23. Важливо! Завжди перевіряйте розпіновка вашої плати перед підключенням. Для цієї збірки знадобиться: Плата ESP32 DEVKIT V15 мм світлодіодРезистор на 330 ОмДжампериМакетна плата (необов'язково) Після підключення всіх компонентів під'єднайте ESP32 до комп'ютера та дотримуйтесь інструкцій: Перейдіть до меню Інструменти > Плата. Знайдіть розділ ESP32 і виберіть плату ESP32, наприклад ESP32 DEVKIT V1.У меню Інструменти > Порт  виберіть порт, до якого під'єднано ESP32. Якщо ви не впевнені в назві порту, від'єднайте плату і перевірте, який порт зник зі списку.Натисніть Завантажити.",{"id":47,"title":48,"titles":49,"content":50,"level":15},"/1-pochatok-roboty-z-esp32#демонстрація","Демонстрація",[6],"Після завантаження коду, вбудований світлодіод, підключений до GPIO 23, блиматиме з інтервалом в 1 секунду.",{"id":52,"title":53,"titles":54,"content":55,"level":15},"/1-pochatok-roboty-z-esp32#можливі-помилки","Можливі помилки",[6],"Failed to connect to ESP32: Timed out... Connecting... Передусім переконайтеся, що в налаштуваннях Arduino IDE вибрано правильну плату та порт. Якщо помилка не зникла, це означає, що плата ESP32 не знаходиться в режимі перепрошивки/завантаження. Щоб завантажити код у такій ситуації, виконайте такі кроки: Затисніть кнопку BOOT на платі ESP32Після того, як ви побачите повідомлення Connecting…. у консолі Arduino IDE, відпустіть палець із кнопки BOOT:Після цього ви маєте побачити повідомлення Done uploading. Після завантаження скетчу натисніть кнопку ENABLE для перезавантаження ESP32.",{"id":57,"title":58,"titles":59,"content":60,"level":15},"/1-pochatok-roboty-z-esp32#на-завершення","На завершення",[6],"Миготіння світлодіодом - це простий проєкт, який допоможе вам почати працювати з ESP32 і дізнатися, як завантажувати прошивку в плату. html pre.shiki code .sW2Sy, html code.shiki .sW2Sy{--shiki-default:#A0A1A7;--shiki-default-font-style:italic;--shiki-dark:#7F848E;--shiki-dark-font-style:italic}html pre.shiki code .sLKXg, html code.shiki .sLKXg{--shiki-default:#A626A4;--shiki-dark:#C678DD}html pre.shiki code .s5ixo, html code.shiki .s5ixo{--shiki-default:#383A42;--shiki-dark:#ABB2BF}html pre.shiki code .sAGMh, html code.shiki .sAGMh{--shiki-default:#986801;--shiki-dark:#D19A66}html pre.shiki code .sAdtL, html code.shiki .sAdtL{--shiki-default:#4078F2;--shiki-dark:#61AFEF}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}",{"id":62,"title":63,"titles":64,"content":65,"level":9},"/2-vstanovlennya-platy-esp32-v-arduino-ide-na-windows","Установка Плати ESP32 В Arduino IDE На Windows",[],"У цьому посібнику ми розповімо, як встановити плату ESP32 в Arduino IDE для Windows Якщо ви використовуєте Mac OS або Linux, дотримуйтесь цього інструкції.",{"id":67,"title":68,"titles":69,"content":70,"level":15},"/2-vstanovlennya-platy-esp32-v-arduino-ide-na-windows#установка-arduino-ide","Установка Arduino IDE",[63],"Завантажити установник можна з офіційного сайту arduino.cc/en/software",{"id":72,"title":73,"titles":74,"content":75,"level":15},"/2-vstanovlennya-platy-esp32-v-arduino-ide-na-windows#установка-esp32","Установка ESP32",[63],"Щоб встановити плату ESP32 у IDE Arduino, виконайте такі дії: Відкрийте вікно налаштувань в Arduino IDE, перейшовши в Файл > УстановкиУ полі Additional Board Manager URLs введіть наступне: https://dl.espressif.com/dl/package_esp32_index.json Натисніть ОК: Якщо у вас вже є URL-адреса плат ESP8266, ви вказати їх через кому: https://dl.espressif.com/dl/package_esp32_index.json, http://arduino.esp8266.com/stable/package_esp8266com_index.json Відкрийте менеджер плат, перейшовши в Інструменти > Плата > Диспетчер Плат…У рядку пошуку введіть ESP32 і натисніть Встановити навпроти ESP32 by Espressif SystemsГотово. Установка триватиме кілька секунд.",{"id":77,"title":78,"titles":79,"content":80,"level":15},"/2-vstanovlennya-platy-esp32-v-arduino-ide-na-windows#налаштування","Налаштування",[63],"Підключіть плату ESP32 до комп'ютера та виконайте такі дії: Відкрийте Arduino IDEОберіть свою плату в меню Інструменти > Плата (в моєму випадку це плата ESP32 DEVKIT V1)Оберіть порт. Якщо ви не бачите COM-порт в Arduino IDE, необхідно встановити ESP32 CP210x USB на UART Bridge VCP Drivers:Відкрийте наступний приклад у меню Файл > Приклади > WiFiScan.Відкриється новий скетч:Натисніть Завантажити до Arduino IDE. Зачекайте кілька секунд, поки код компілюється та завантажується у плату.Якщо все гаразд, ви повинні побачити повідомлення Done uploadingВідкрийте монітор серійного порту Arduino IDE і встановіть швидкість 115200 бод: Натисніть EN на платі ESP32, і ви побачите мережі, доступні поряд з ESP32:",{"id":82,"title":58,"titles":83,"content":84,"level":15},"/2-vstanovlennya-platy-esp32-v-arduino-ide-na-windows#на-завершення",[63],"Це простий посібник, який ілюструє, як підготувати ваш Arduino IDE для роботи з ESP32 на ПК з Windows.",{"id":86,"title":87,"titles":88,"content":65,"level":9},"/3-vstanovlennya-platy-esp32-v-arduino-ide-na-mac-os-x-i-linux","Установка плати ESP32 в Arduino IDE на Mac OS X та Linux",[],{"id":90,"title":68,"titles":91,"content":70,"level":15},"/3-vstanovlennya-platy-esp32-v-arduino-ide-na-mac-os-x-i-linux#установка-arduino-ide",[87],{"id":93,"title":73,"titles":94,"content":75,"level":15},"/3-vstanovlennya-platy-esp32-v-arduino-ide-na-mac-os-x-i-linux#установка-esp32",[87],{"id":96,"title":78,"titles":97,"content":80,"level":15},"/3-vstanovlennya-platy-esp32-v-arduino-ide-na-mac-os-x-i-linux#налаштування",[87],{"id":99,"title":58,"titles":100,"content":84,"level":15},"/3-vstanovlennya-platy-esp32-v-arduino-ide-na-mac-os-x-i-linux#на-завершення",[87],{"id":102,"title":103,"titles":104,"content":105,"level":9},"/4-rozpynuvannya-esp32","Розпінування ESP32",[],"ESP32 — популярний мікроконтролер із вбудованим Wi-Fi та Bluetooth, використовується в IoT-проектах. Для успішної роботи з платою важливо розуміти призначення її контактів. Чіп ESP32 оснащений 48 мультифункціональними контактами. Не всі контакти доступні на всіх платах ESP32 і деякі контакти не можна використовувати. На малюнку нижче показано розпіновку чіпа ESP-WROOM-32. Використовуйте його як довідковий матеріал, якщо ви використовуєте голу мікросхему ESP32 для складання власної плати: Не всі GPIO доступні на всіх платах розробки, але кожен конкретний GPIO працює однаково, незалежно від плати розробки, що використовується. Якщо ви починаєте працювати з ESP32, рекомендуємо прочитати наше керівництво: Початок роботи з платою розробки ESP32.",{"id":107,"title":108,"titles":109,"content":110,"level":15},"/4-rozpynuvannya-esp32#периферія-esp32","Периферія ESP32",[103],"18 каналів аналого-цифрового перетворювача (АЦП)3 інтерфейси SPI3 інтерфейси UART2 інтерфейси I2C16 вихідних каналів ШІМ2 цифро-аналогові перетворювачі (ЦАП)2 інтерфейси I2S10 ємнісних датчиків GPIO Функції АЦП (аналого-цифровий перетворювач) та ЦАП (цифро-аналоговий перетворювач) призначаються певним статичним контактам. Тим не менш, в коді програми ви можете призначити якісь контакти як UART, I2C, SPI, PWM і т. д. Це можливо завдяки функції мультиплексування чіпа ESP32. Хоча ви можете визначати властивості контактів у програмному забезпеченні, є контакти, призначені за замовчуванням, як показано на малюнку (це приклад плати ESP32 DEVKIT V1 DOIT з 36 контактами — розташування контактів може змінюватися в залежності від виробника). Крім того, є контакти з певними функціями, які роблять їх відповідними або не підходящими для конкретного проекту. У наступній таблиці показано, які контакти найкраще використовувати як входи, виходи, а з якими слід бути обережними. Контакти, виділені зеленим, підходять для використання. Ті, що виділені жовтим кольором, підходять для використання, але на них варто звернути увагу, оскільки вони можуть мати несподівану поведінку, в основному при завантаженні. Контакти, виділені червоним, не рекомендується використовувати як входи або виходи. GPIOВведенняКонтактОсобливості0підключений через підтягуючий резисторOKвиводить ШІМ сигнал під час завантаження1TX пінOKналагоджувальний контакт під час завантаження2OKOKпідключений до вбудованого світлодіода, повинен залишатися плаваючим або перебувати у стані LOW для переходу в режим миготіння3OKRX пінвиводить сигнал високого рівня під час завантаження4OKOK5OKOKвиводить ШИМ сигнал під час завантаження.6XXпідключений до вбудованої флеш-пам'яті SPI7XXпідключений до вбудованої флеш-пам'яті SPI8XXпідключений до вбудованої флеш-пам'яті SPI9XXпідключений до вбудованої флеш-пам'яті SPI10XXпідключений до вбудованої флеш-пам'яті SPI11XXпідключений до вбудованої флеш-пам'яті SPI12OKOKESP32 не завантажується, якщо вхід підтягнутий до HIGH, що з'єднує контакт13OKOK14OKOKвиводить ШІМ сигнал під час завантаження15OKOKвиводить ШІМ сигнал під час завантаження16OKOK17OKOK18OKOK19OKOK21OKOK22OKOK23OKOK25OKOK26OKOK27OKOK32OKOK33OKOK34OKлише вхід35OKлише вхід36OKлише вхід39OKлише вхід",{"id":112,"title":113,"titles":114,"content":115,"level":15},"/4-rozpynuvannya-esp32#піни-входу","Піни входу",[103],"GPIOs 34-39 є GPI - тобто працюють тільки в режимі введення, так як вони не оснащені резистором, що підтягує. GPIO 34GPIO 35GPIO 36GPIO 39",{"id":117,"title":118,"titles":119,"content":120,"level":15},"/4-rozpynuvannya-esp32#spi-flash-на-esp-wroom-32","SPI flash на ESP-WROOM-32",[103],"GPIO з 6 по 11 мають контакти на деяких платах розробки ESP32, але ці контакти приєднані до вбудованого модуля SPI flash на чіпі ESP-WROOM-32 і не рекомендується використовувати їх з іншою метою. GPIO 6 (SCK/CLK)GPIO 7 (SDO/SD0)GPIO 8 (SDI/SD1)GPIO 9 (SHD/SD2)GPIO 10 (SWP/SD3)GPIO 11 (CSC/CMD)",{"id":122,"title":123,"titles":124,"content":125,"level":15},"/4-rozpynuvannya-esp32#gpio-з-підтримкою-ємнісного-дотику","GPIO з підтримкою ємнісного дотику",[103],"ESP32 обладнана 10 ємнісними сенсорами торкання. Ці датчики можуть вловлювати зміни у будь-чому, що має електричний заряд, наприклад, у шкірі людини. Таким чином, вони можуть виявляти зміни, що виникають при дотику пальцем контактів GPIO. Ці контакти легко інтегруються в ємнісні контактні майданчики та замінюють механічні кнопки. Ємнісні сенсорні контакти можна використовувати для виведення ESP32 з режиму глибокого сну.\nЦі внутрішні датчики торкання підключені до цих контактів GPIO: T0 (GPIO 4)T1 (GPIO 0)T2 (GPIO 2)T3 (GPIO 15)T4 (GPIO 13)T5 (GPIO 12)T6 (GPIO 14)T7 (GPIO 27)T8 (GPIO 33)T9 (GPIO 32)",{"id":127,"title":128,"titles":129,"content":130,"level":15},"/4-rozpynuvannya-esp32#аналого-цифровий-перетворювач-ацп","Аналого-цифровий перетворювач (АЦП)",[103],"ESP32 має 18 вхідних 12-бітових каналів АЦП (тоді як ESP8266 має лише 1 10-бітний АЦП). Нижче перераховані GPIO, які можна використовувати як АЦП, і з відповідні канали: ADC1_CH0 (GPIO 36)ADC1_CH1 (GPIO 37)ADC1_CH2 (GPIO 38)ADC1_CH3 (GPIO 39)ADC1_CH4 (GPIO 32)ADC1_CH5 (GPIO 33)ADC1_CH6 (GPIO 34)ADC1_CH7 (GPIO 35)ADC2_CH0 (GPIO 4)ADC2_CH1 (GPIO 0)ADC2_CH2 (GPIO 2)ADC2_CH3 (GPIO 15)ADC2_CH4 (GPIO 13)ADC2_CH5 (GPIO 12)ADC2_CH6 (GPIO 14)ADC2_CH7 (GPIO 27)ADC2_CH8 (GPIO 25)ADC2_CH9 (GPIO 26) Примітка: контакти АЦП2 не можна використовувати під час використання Wi-Fi. Тому, якщо ви використовуєте Wi-Fi і у вас виникають проблеми з отриманням значення з виходу АЦП2 GPIO, спробуйте використати замість нього вихід АЦП1 GPIO — це має вирішити проблему. Вхідні канали АЦП мають роздільну здатність 12 біт. Це означає, що ви можете отримувати аналогові показання в діапазоні від 0 до 4095, де 0 відповідає 0, а 4095 - 3,3 В. Ви також можете задати дозвіл каналів в коді, а також діапазон АЦП. Висновки АЦП ESP32 немає лінійного поведінки. Ви, ймовірно, не зможете відрізнити 0 від 0,1 або 3,2 від 3,3 В. Це необхідно враховувати при використанні контактів АЦП. Ви отримаєте поведінку, схожу на показану на наступному малюнку.",{"id":132,"title":133,"titles":134,"content":135,"level":15},"/4-rozpynuvannya-esp32#цифро-аналоговий-перетворювач-цап","Цифро-аналоговий перетворювач (ЦАП)",[103],"ESP32 має два 8-бітових канали ЦАП для перетворення цифрових сигналів в аналогові вихідні сигнали напруги. Канали ЦАП: DAC1 (GPIO25)DAC2 (GPIO26)",{"id":137,"title":138,"titles":139,"content":140,"level":15},"/4-rozpynuvannya-esp32#rtc-gpios","RTC GPIOs",[103],"ESP32 підтримує RTC GPIO. Висновки GPIO, підключені до RTC з низьким енергоспоживанням, можуть використовуватися, коли ESP32 знаходиться в режимі глибокого сну. Ці RTC GPIO можна використовувати для виведення ESP32 із режиму глибокого сну під час роботи співпроцесора з ультранизким енергоспоживанням (ULP). Наступні контакти GPIO можна використовувати як зовнішнє джерело пробудження: RTC_GPIO0 (GPIO36)RTC_GPIO3 (GPIO39)RTC_GPIO4 (GPIO34)RTC_GPIO5 (GPIO35)RTC_GPIO6 (GPIO25)RTC_GPIO7 (GPIO26)RTC_GPIO8 (GPIO33)RTC_GPIO9 (GPIO32)RTC_GPIO10 (GPIO4)RTC_GPIO11 (GPIO0)RTC_GPIO12 (GPIO2)RTC_GPIO13 (GPIO15)RTC_GPIO14 (GPIO13)RTC_GPIO15 (GPIO12)RTC_GPIO16 (GPIO14)RTC_GPIO17 (GPIO27)",{"id":142,"title":143,"titles":144,"content":145,"level":15},"/4-rozpynuvannya-esp32#широтно-імпульсна-модуляція-шім","Широтно-імпульсна модуляція (ШІМ)",[103],"Контролер світлодіодів ESP32 із ШІМ має 16 незалежних каналів, які можна налаштувати для генерації ШІМ-сигналів із різними характеристиками. Усі контакти, які можуть працювати як виходи, можуть використовуватися як контакти ШІМ (контакти GPIO з 34 до 39 не підтримують генерацію ШІМ). Для встановлення ШИМ-сигналу необхідно визначити такі параметри в коді: частота сигналу;коефіцієнт заповнення;канал ШІМ;Порт GPIO, який ви хочете подати сигнал.",{"id":147,"title":148,"titles":149,"content":150,"level":15},"/4-rozpynuvannya-esp32#i2c","I2C",[103],"При використанні ESP32 з Arduino IDE слід використовувати стандартні контакти ESP32 I2C (підтримувані бібліотекою Wire): GPIO 21 (SDA)GPIO 22 (SCL)",{"id":152,"title":153,"titles":154,"content":155,"level":15},"/4-rozpynuvannya-esp32#serial-peripheral-interface-spi","Serial Peripheral Interface (SPI)",[103],"За промовчанням призначення контактів для SPI: SPIMOSIMISOCLKCSVSPIGPIO 23GPIO 19GPIO 18GPIO 5HSPIGPIO 13GPIO 12GPIO 14GPIO 15",{"id":157,"title":158,"titles":159,"content":160,"level":9},"/4-rozpynuvannya-esp32#uart","UART",[],"ESP32 підтримує до трьох інтерфейсів UART: UART0, UART1 і UART2, залежно від моделі плати ESP32, що використовується. Порт UART0 зазвичай резервується для зв'язку з послідовним монітором під час завантаження та налагодження. Однак його також можна використовувати для зв'язку з іншими пристроями після завантаження коду, якщо монітор не потрібен.\nUART1 та UART2: доступні для зв'язку із зовнішніми пристроями.\nЯк і I2C і SPI, ці контакти UART можна призначити будь-якому контакту GPIO ESP32. Однак, на більшості моделей плат вони мають стандартне призначення контактів.\nДля більшості плат ESP32 призначення контактів UART є наступним: UART PortTXRXRemarksUART0GPIO 1GPIO 3Used for Serial Monitor and uploading code; Can be assigned to other GPIOs;UART1GPIO 10GPIO 9Must be assigned to other GPIOsUART2GPIO 17GPIO 16Can be assigned to other GPIOs Що стосується UART1 (GPIO 9 і GPIO10), ці контакти GPIO підключені до флеш-пам'яті ESP32 SPI, тому використовувати їх не можна. Щоб використати UART1 для зв'язку з іншими пристроями, необхідно визначити інші контакти за допомогою бібліотеки HardwareSerial.",{"id":162,"title":163,"titles":164,"content":165,"level":15},"/4-rozpynuvannya-esp32#переривання","Переривання",[158],"Всі GPIO можна настроїти на переривання.",{"id":167,"title":168,"titles":169,"content":170,"level":15},"/4-rozpynuvannya-esp32#звязувальні-контакти","Зв'язувальні контакти",[158],"Чіп ESP32 має такі зв'язувальні контакти: GPIO 0GPIO 2GPIO 4GPIO 5GPIO 12GPIO 15 Вони використовуються для переведення ESP32 у режим завантажувача або прошивки. На більшості плат з вбудованим USB/послідовним портом вам не потрібно турбуватися про стан цих контактів. Плата сама переводить контакти в стан, необхідний для прошивки чи завантаження. Докладніше про вибір режиму завантаження ESP32 можна дізнатися тут. Однак, якщо до цих контактів підключено периферійні пристрої, можуть виникнути проблеми із завантаженням нового коду, прошивкою ESP32 або скиданням налаштувань плати. Якщо до цих контактів підключено периферійні пристрої, і виникають проблеми із завантаженням коду або прошивкою ESP32, можливо, ці пристрої заважають ESP32 перейти в потрібний режим. Ознайомтеся з документацією щодо вибору режиму завантаження, щоб дізнатися, як це зробити. Після скидання налаштувань, прошивки або завантаження ці контакти працюють як слід.",{"id":172,"title":173,"titles":174,"content":175,"level":15},"/4-rozpynuvannya-esp32#контакти-high-при-завантаженні","Контакти HIGH при завантаженні",[158],"Деякі GPIO змінюють стан на HIGH або виводять ШИМ-сигнали під час завантаження чи скидання. Це означає, що якщо до цих GPIO підключені виходи, ви можете отримати несподівані результати під час скидання або завантаження ESP32. GPIO 1GPIO 3GPIO 5GPIO 6–GPIO 11 (підключений до інтегрованої флеш-пам'яті SPI ESP32 – не рекомендується використовувати).GPIO 14GPIO 15",{"id":177,"title":178,"titles":179,"content":180,"level":15},"/4-rozpynuvannya-esp32#enable-en","Enable (EN)",[158],"Вивід «Enable» (EN) – це контакт увімкнення регулятора напруги 3,3 В. Він підтягнутий до потенціалу, тому для відключення регулятора напруги 3,3 В його слід підключити до заземлення. Це означає, що цей контакт можна використовувати, підключивши його до кнопки, наприклад, для перезапуску ESP32.",{"id":182,"title":183,"titles":184,"content":185,"level":15},"/4-rozpynuvannya-esp32#потужний-струм-gpio","Потужний струм GPIO",[158],"Абсолютний максимальний струм, споживаний кожним GPIO, становить 40 мА відповідно до розділу «Рекомендовані умови експлуатації» у технічному описі ESP32.",{"id":187,"title":188,"titles":189,"content":190,"level":15},"/4-rozpynuvannya-esp32#вбудований-датчик-холла-esp32","Вбудований датчик Холла ESP32",[158],"ESP32 також має вбудований датчик Холла, який виявляє зміни магнітного поля навколо нього.",{"id":192,"title":58,"titles":193,"content":194,"level":15},"/4-rozpynuvannya-esp32#на-завершення",[158],"Сподіваємося, цей довідковий посібник з GPIO-портів ESP32 був вам корисним. Якщо у вас є додаткові поради щодо GPIO-портів ESP32, будь ласка, поділіться ними в коментарях нижче.",4,[197,207,214,220],{"path":102,"cover":198,"title":103,"description":199,"date":200,"tags":201,"authors":203},"/images/4/cover.webp","ESP32 — популярний мікроконтролер із вбудованим Wi-Fi та Bluetooth, використовується в IoT-проектах. Для успішної роботи з платою важливо розуміти призначення її контактів.","2025-09-04T00:00:00.000Z",[202],"ESP32",[204],{"name":205,"avatar":206},"Niqitos","/images/avatars/niqitos.jpg",{"path":86,"cover":208,"title":87,"description":65,"date":209,"tags":210,"authors":212},"/images/3/cover.webp","2025-09-03T00:00:00.000Z",[211,202],"Arduino",[213],{"name":205,"avatar":206},{"path":62,"cover":215,"title":63,"description":65,"date":216,"tags":217,"authors":218},"/images/2/cover.webp","2025-09-02T00:00:00.000Z",[211,202],[219],{"name":205,"avatar":206},{"path":5,"cover":221,"title":6,"description":8,"date":222,"tags":223,"authors":224},"/images/1/cover.webp","2025-09-01T00:00:00.000Z",[202],[225],{"name":205,"avatar":206},[227,229,231,233],{"tags":228},[202],{"tags":230},[211,202],{"tags":232},[211,202],{"tags":234},[202],1757269460749]